Revit 2024 API
BuiltInFailures.ExportFailures.IFCFatalToolkitExportError Property
 There has been an unrecoverable error during export. Export will now be aborted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IFCFatalToolkitExportError { get; }
Visual Basic
Public Shared ReadOnly Property IFCFatalToolkitExportError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IFCFatalToolkitExportError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ExportFailures Class
Autodesk.Revit.DB Namespace